app/CryptoCurrency.php

select `charge` from `agency_charges` where `crypto_currency_id` = 1 order by `date` desc limit 1
---
    public function getCoursActuel()
    {
        $cours =  DB::table('agency_charges')
            ->select('charge')
            ->orderBy('date', 'desc')
            ->where('crypto_currency_id', '=', $this->id)
            ->first();