app/Http/Controllers/BackendController.php

select * from `users`
---
    public function showcustomers()
    {
        $users = DB::table('users');
        $currentUser = Auth::user();
        $allusers = User::all();

select * from `spend_currencies`
select * from `agency_charges`
---
    public function listMonnaie()
    {
        $currentUser = Auth::user();
        $cryptos = CryptoCurrency::get();
        $spend_currencies = SpendCurrency::all();
        $agency_charges = AgencyCharge::all();

select * from `spend_currencies`
select * from `agency_charges`
---
    public function listMonnaieAdmin()
    {
        $currentUser = Auth::user();
        $cryptos = CryptoCurrency::get();
        $spend_currencies = SpendCurrency::all();
        $agency_charges = AgencyCharge::all();