app/Http/Controllers/ChartController.php

    public function index()
    {
        $currentUser = Auth::user();
        $customer_wallet= CustomerWallet::find($currentUser->id);
        $cryptos = CryptoCurrency::all();
        $valeurId = 1;
        $agency_charges = AgencyCharge::where('crypto_currency_id', '=', $valeurId)->get();
---
select * from `crypto_currencies`
select * from `agency_charges` where `crypto_currency_id` = 1

    public function showCrypto(CryptoCurrency $crypto)
    {
        $currentUser = Auth::user();
        $customer_wallet = CustomerWallet::find($currentUser->id);
        $cryptos = CryptoCurrency::all();
        $valeurId = $crypto->id;
        $agency_charges = AgencyCharge::where('crypto_currency_id', '=', $valeurId)->get();
---
select * from `crypto_currencies`
select * from `agency_charges` where `crypto_currency_id` = 1