app/Http/Controllers/CustomerController.php

delete from `users` where `id` = 1
---
    public function destroy(User $user)
    {

        User::destroy($user->id);