app/Http/Controllers/HomeController.php

    public function index()
    {
        $currentUser = Auth::user();
        $allusers = User::all();
        $spend_currencies = SpendCurrency::all();
        $cryptos = CryptoCurrency::all();
        $agency_charges = AgencyCharge::all();
---
select * from `users`
select * from `spend_currencies`
select * from `crypto_currencies`
select * from `agency_charges`