app/Http/Controllers/SpendcurrencyController.php

    public function index()
    {
        $currentUser = Auth::user();
        $spend_currencies = SpendCurrency::where('users_id', '=' , $currentUser->id)
        ->where('active', '=', 1)->get();
        $customer_wallet = CustomerWallet::find($currentUser->id);

        $cryptos = CryptoCurrency::all();
        $agency_charges = AgencyCharge::all();
---
select * from `spend_currencies` where `users_id` = 11 and `active` = 1
select * from `crypto_currencies`
select * from `agency_charges`

    public function showHistorique() {
        $currentUser = Auth::user();
        $spend_currencies = SpendCurrency::where('users_id', '=' , $currentUser->id)->orderBy('purchase_date', 'desc')->get();
        $purchases = SpendCurrency::where('users_id', '=' , $currentUser->id)
        ->where('active', '=', 1)->orderBy('purchase_date', 'desc')->get();
        $sells = SpendCurrency::where('users_id', '=' , $currentUser->id)
        ->where('active', '=', 0)->orderBy('purchase_date', 'desc')->get();
        $customer_wallet = CustomerWallet::find($currentUser->id);
        $cryptos = CryptoCurrency::all();
        $agency_charges = AgencyCharge::all();
---
select * from `spend_currencies` where `users_id` = 11 order by `purchase_date` desc
select * from `spend_currencies` where `users_id` = 11 and `active` = 1 order by `purchase_date` desc
select * from `spend_currencies` where `users_id` = 11 and `active` = 0 order by `purchase_date` desc
select * from `crypto_currencies`
select * from `agency_charges`

    public function confirmBuyCrypto(Request $request, CryptoCurrency $crypto)
    {
        $today = Carbon::today();
        $currentUser = Auth::user();
        $customer_wallet = CustomerWallet::find($currentUser->id);
        $current_cours = AgencyCharge::where('crypto_currency_id', '=', $crypto->id)
                ->where('date', '=', $today)->get();
---
select * from `agency_charges` where `crypto_currency_id` = 1 and `date` = '2019-05-24 00:00:00'